{"version": "https://www.jsonfeed.org/version/1.1/", "title": "famubu's blog", "home_page_url": "https://ju-sh.github.io/blog/index.html", "feed_url": "https://ju-sh.github.io/feeds/blog/json.json", "description": "Software stuff, random musings...", "authors": [{"name": "famubu", "url": "https://ju-sh.github.io/index.html", "language": "en"}], "items": [{"id": "https://ju-sh.github.io/blog/panel-rsd7-iitpkd.html", "url": "https://ju-sh.github.io/blog/panel-rsd7-iitpkd.html", "title": "Panel discussion - RSD 7 @ IITPKD", "content_html": "<div id=\"content-container\">\n<p>Research scholars day of IIT Palakkad for the year 2025 (RSD 7) was held between February 21st and 22nd. As part of this event, a panel discussion was held which went over matters related to research life. The panel consisted of professors from IITPKD.</p>\n<p>This post is an outline of the thoughts from this session. (Occasionally augmented with my own comments. So this may not be exactly what was discussed.)</p>\n<ul>\n<li>Learn not just to answer a question but <strong>to ask the right question</strong>\n<ul>\n<li>Look at recent papers in your field</li>\n<li>Identify the common source of truth that these paper seems to derive from</li>\n<li>Start research from that point and figure how to arrive at that source of truth</li>\n<li>ie, See what is the <strong>common direction of the papers</strong> being published and try to arrive at the source</li>\n<li>Remark: Hitchhiker's guide to galaxy quote\n<ul>\n<li>What is the answer to life, the universe, everything? 42.</li>\n<li>Then what is the meaning of the question ??!</li>\n<li>ie, before finding the answer, one should have a clear idea of the question.</li>\n</ul></li>\n</ul></li>\n<li>Number of publications vs quality of research\n<ul>\n<li>Quality should matter more than quantity</li>\n<li>Unfortunately, Quality is not quanitifiable</li>\n<li>Difficult for a group of people to rank papers based on quality</li>\n<li>Number is the only metric by which can be agreed upon by everyone</li>\n<li>For this reason, number of publications is often used to decide who gets promotion, funding, etc.</li>\n<li>Quality is not quanitifiable</li>\n<li>Suggestion: <strong>Focus on quality, but don't neglect quantity</strong>.</li>\n</ul></li>\n<li>About advisors potentially pushing student to publish review papers\n<ul>\n<li>Since review papers are much more likely to accumulate citations</li>\n<li>Review papers is not original research, but is literature review</li>\n<li>Suggestion:\n<ul>\n<li><strong>Literature review is a critical skill in research</strong></li>\n<li>But literature review must lead to new ideas being explored</li>\n<li>One shouldn't stick to writing review papers</li>\n<li>Like in the case quantity vs quality,</li>\n</ul></li>\n</ul></li>\n<li>Literature review\n<ul>\n<li>You should know the state of art before starting the actual work</li>\n<li>Helps avoid duplication of effort</li>\n<li>You are likely to gain insights</li>\n</ul></li>\n<li>Finding a research topic\n<ul>\n<li>Seek something that you are passionate about</li>\n<li>Know more about it. Read literature. Talk to people working in that domain.</li>\n<li>See how you can advance the state of the art.</li>\n<li>See what contribution can you make to make the work of future researchers easier.</li>\n<li>Something that others can build on.</li>\n<li>ie, <strong>find something that you are passionate about and see how to make that better</strong></li>\n</ul></li>\n<li>Incremental research vs breakthroughs\n<ul>\n<li>Most research is incremental in nature</li>\n<li>A PhD work usually extends the boundaries of knowledge a little bit</li>\n<li>Although breakthrough ideas are nice, that is not for everyone.</li>\n<li>In maths, 10 mediocre theorems may be easier to prove than one big theorem</li>\n<li>Method used by a panelist to identify a worthwhile proof:\n<ul>\n<li>Write the proof, keep it away for a few weeks.</li>\n<li>By now you probably can't recall the details of the proof.</li>\n<li>Come back and read what you wrote earlier.</li>\n<li>If you are amazed by the proof, it is great.</li>\n<li>Otherwise, it is mediocre.</li>\n</ul></li>\n</ul></li>\n<li>Importance of research collaboration\n<ul>\n<li>How to meet people: Attend conferences, summer schools, webinars</li>\n<li>Establish connections while attending events\n<ul>\n<li>Send a mail</li>\n<li>If you have a concrete idea to work on, keep at it don't let lie</li>\n</ul></li>\n<li><strong>Collobrations should be with people whose expertise you can complement</strong>\n<ul>\n<li>This also allows both parties to better appreciate each other.</li>\n<li>Both parties bring something new to the table, thereby achieving something that neither would've been able to achieve alone.</li>\n</ul></li>\n<li>Casual conversations sometimes lead to full blown collaborations</li>\n<li>Story shared by a panelist: \n<ul>\n<li>Panelist published a paper in an interdisciplinary domain with a collaborator</li>\n<li>The collaborator and the panelist were members of the mess committe of their institute</li>\n<li>While running an errand related to the mess (buying samosas), they had a chat about their areas of research.</li>\n<li>This eventually led to a colloboration resulting in a paper.</li>\n<li>A professor in the audience remarked that this is another reason why students should consider joining the mess committee. :D</li>\n</ul></li>\n<li>Suggestions:\n<ul>\n<li>Talk about your research to anyone who would listen</li>\n<li>Ask about others' research and listen to anyone who has the time to talk about their work.</li>\n</ul></li>\n</ul></li>\n<li>Knowing which journal to submit to: \n<ul>\n<li>It could help to know the expertise of editors before submitting to journal</li>\n<li>Even for good quality submissions, if the reviewer is not familiar with the topic, they could judge it poorly.</li>\n</ul></li>\n<li>Role of AI/ML:\n<ul>\n<li>AI isn't everything, nor is it nothing</li>\n<li>It can make positive contributions\n<ul>\n<li>Eg: Chatgpt is capable of helping people make beamer slides</li>\n</ul></li>\n<li>These days applications of AIML is being helpful in almost every domains</li>\n<li>To know the benefit of applying concepts or output from another field, there should be interdisciplinary communication\n<ul>\n<li>Eg: Mechanical dept student should talk with CSE/Data science to learn how AIML can help them automate some of their work.</li>\n</ul></li>\n<li>Disadvantage: Big applications like chatgpt is difficult for normal people to run on their own.\n<ul>\n<li>Have to depend on vendors who could charge users.</li>\n</ul></li>\n<li>Whether it will take away jobs?\n<ul>\n<li>Probably.</li>\n<li>Once computers began to get popular, many jobs vanished</li>\n<li>But computers did make life better.</li>\n<li>Ideally, people should be capable of adapting to changing environment.</li>\n</ul></li>\n<li>Concern: What if people start depending on AI too much that they 'forget' how to do the things that they come to depend on AI for?\n<ul>\n<li>Remark by panelist: Similar to a scenario in an Isaac Asimov novel</li>\n<li>As in, there are inteliigent machines, but no human knows to build one anymore.</li>\n<li>Not an invalid point, I guess.</li>\n<li>Use of computers and calculators has made mental arithmetic less necessary.</li>\n<li>But people can now possibly use the time spent on mastering mental arithmetic skills to do other work.</li>\n<li>The novel: <em>Prelude to Foundation</em> - 1st prequel in the <em>Foundation</em> series</li>\n</ul></li>\n</ul></li>\n<li>Example of handling hostile paper reviews\n<ul>\n<li>Reviews are usually helpful</li>\n<li>If a review's tone is hostile, disregard the tone and use the feedback itself if it makes sense.</li>\n<li>If the reviewer is being unnecessarily hostile, contact the journal's editor.</li>\n<li>Eg: A paper review mentioned that the submitter is arrogant because of the delay in incorporating suggested changes. Even though there was no direct communication between submitter and the reviewer.</li>\n</ul></li>\n</ul>\n<ul>\n<li>Finish your PhD as soon as possible\n<ul>\n<li>During a PhD, you will be making much less money that you would if you were in the industry.</li>\n<li><strong>Every extra year you take to complete PhD is loss of great amount of money and immense amount of wasted value in terms of time</strong></li>\n<li>You do your best work when you are young</li>\n<li>Use your youth to do good work and gain experience</li>\n<li>When you get old, you are less likely to be energetic, but you can use your experience to help collaborators and still get good work done.</li>\n<li>Great insights are derived from past experiences</li>\n<li>ie, time is limited. Use it effectively.</li>\n</ul></li>\n</ul>\n<p>Interesting stuff:</p>\n<ul>\n<li>IEEE seems to have banned the world 'novel' from the titles of papers that it publishes\n<ul>\n<li>Probably due to too many papers using it.</li>\n<li>(Couldn't find the source)</li>\n</ul></li>\n<li>Joke?: Review of a 4 page write-up spanned 5 pages.</li>\n</ul>\n<p>—</p>\n<p>Thanks to:</p>\n<ul>\n<li>The students who organized the event</li>\n<li>Moderator: Dr. Albert Sunny</li>\n<li>Panelists:\n<ul>\n<li>Dr. Dinesh Jagadeeshan (Dept. of Chemistry)</li>\n<li>Dr. Jaikrishnan Janardhanan (Dept. of Mathematics)</li>\n<li>Dr. Kesavan D. (Dept. of Mechanical Engineering)</li>\n<li>Dr. Sabarimalai Manikandan (Dept. of Electrical Engineering)</li>\n</ul></li>\n</ul>\n<hr/>\n<p>Just for fun, here's the part from Hitchiker's guide to galaxy (book version) mentioned earlier.</p>\n<p>From <em>The hitchhiker's guide to the galaxy</em> by Douglas Adams:</p>\n<blockquote>\n<p>\"Seventy-five thousand generations ago, our ancestors set this program in motion,\" the second man said, \"and in all that time we will be the first to hear the computer speak.\"</p>\n<p>\"An awesome prospect, Phouchg,\" agreed the first man, and Arthur suddenly realized that he was watching a recording with subtitles.</p>\n<p>\"We are the ones who will hear,\" said Phouchg, \"the answer to the great question of Life …!\"<br/>\n\"The Universe …!\" said Loonquawl.<br/>\n\"And Everything …!\"<br/>\n\"Shhh,\" said Loonquawl with a slight gesture, \"I think Deep Thought is preparing to speak!\"</p>\n<p>There was a moment's expectant pause whilst panels slowly came to life on the front of the console. Lights flashed on and off experimentally and settled down into a businesslike pattern. A soft low hum came from the communication channel.</p>\n<p>\"Good morning,\" said Deep Thought at last.<br/>\n\"Er … Good morning, O Deep Thought,\" said Loonquawl nervously, \"do you have … er, that is …\"<br/>\n\"An answer for you?\" interrupted Deep Thought majestically. \"Yes. I have.\"<br/>\nThe two men shivered with expectancy. Their waiting had not been in vain.<br/>\n\"There really is one?\" breathed Phouchg.<br/>\n\"There really is one,\" confirmed Deep Thought.<br/>\n\"To Everything? To the great Question of Life, the Universe and Everything?\"<br/>\n\"Yes.\"<br/>\nBoth of the men had been trained for this moment, their lives had been a preparation for it, they had been selected at birth as those who would witness the answer, but even so they found themselves gasping and squirming like excited children.<br/>\n\"And you're ready to give it to us?\" urged Loonquawl. \"I am.\"<br/>\n\"Now?\"<br/>\n\"Now,\" said Deep Thought.<br/>\nThey both licked their dry lips.<br/>\n\"Though I don't think,\" added Deep Thought, \"that you're going to like it.\"<br/>\n\"Doesn't matter!\" said Phouchg. \"We must know it! Now!\"<br/>\n\"Now?\" inquired Deep Thought.<br/>\n\"Yes! Now …\"<br/>\n\"Alright,\" said the computer and settled into silence again. The two men fidgeted. The tension was unbearable.<br/>\n\"You're really not going to like it,\" observed Deep Thought.<br/>\n\"Tell us!\"<br/>\n\"Alright,\" said Deep Thought. \"The Answer to the Great Question …\"<br/>\n\"Yes …!\"<br/>\n\"Of Life, the Universe and Everything …\" said Deep Thought.<br/>\n\"Yes …!\"<br/>\n\"Is …\" said Deep Thought, and paused.<br/>\n\"Yes …!\"<br/>\n\"Is …\"<br/>\n\"Yes …!!!…?\"<br/>\n\"Forty-two,\" said Deep Thought, with infinite majesty and calm.</p>\n<p>It was a long time before anyone spoke.<br/>\nOut of the corner of his eye Phouchg could see the sea of tense expectant faces down in the square outside.</p>\n<p>\"We're going to get lynched aren't we?\" he whispered.<br/>\n\"It was a tough assignment,\" said Deep Thought mildly.<br/>\n\"Forty-two!\" yelled Loonquawl. \"Is that all you've got to show for seven and a half million years' work?\"<br/>\n\"I checked it very thoroughly,\" said the computer, \"and that quite definitely is the answer. I think the problem, to be quite honest with you, is that you've never actually known what the question is.\"<br/>\n\"But it was the Great Question! The Ultimate Question of Life, the Universe and Everything!\" howled Loonquawl.<br/>\n\"Yes,\" said Deep Thought with the air of one who suffers fools gladly, \"but what actually is it?\"</p>\n<p>A slow stupefied silence crept over the men as they stared at the computer and then at each other.</p>\n<p>\"Well, you know, it's just Everything … Everything …\" offered Phouchg weakly.<br/>\n\"Exactly!\" said Deep Thought. \"So once you do know what the question actually is, you'll know what the answer means.\"</p>\n</blockquote>\n</div>", "summary": "Notes from the panel discussion held as part of RSD 7 at IITPKD", "date_published": "2025-03-11T00:00:00+00:00", "tags": ["outline"]}]}